{
    "trial_type" : {
        "LongName": "Stimulus class.",
        "Description": "Class of the stimulus presented (a class is a set of stimuli with the same w_r and w_a values; there are eight phases per class, which all have distinct stim_file_index values but the same trial_type), corresponds to class_idx in the stimulus description csv. n/a indicates a digit-only trial, the sixteen seconds at the beginning and end of the run.",
        "DataType": "integer"
    },
    "stim_file" : {
        "LongName": "Name of stimulus file",
        "Description": "Name of the stimulus file, found within the /stimuli folder. n/a means no stimulus presented (in sixteen seconds at beginning and end of run).",
        "DataType": "string"
    },
    "stim_file_index": {
        "LongName": "Stimulus file index",
        "Description": "Index (zero-indexed) of the presented stimulus in the corresponding stim_file. n/a means no stimulus presented (in the sixteen seconds at beginning and end of run).",
        "DataType": "integer"
    },
    "response_time" : {
        "LongName": "Response time",
        "Description": "Response time measured in seconds. n/a denotes no button press (which is sometimes the correct response).",
        "DataType": "float"
    },
    "outcome" : {
        "LongName": "Behavioral response.",
        "Description": "Outcome of the trial, in signal detection theory terms. A stream of digits was presented at fixation, and the task was to press a button whenever a digit repeated. Correct response is to either press the button when digit repeats or to not press when digit changes.",
        "Levels": {
            "hit": "Stimulus present, subject answered present.",
            "miss": "Stimulus present, subject answered absent.",
            "correction_rejection": "Stimulus absent, subject answered absent.",
            "false_alarm": "Stimulus absent, subject answered present.",
            "n/a": "In addition to subject responses, tsv contains info about presented stimuli. The stimuli changed every half second, whereas the digit changed every second, so n/a marks those inter-trial intervals."
        }
    },
    "note": {
        "LongName": "Stimulus note",
        "Description": "Space for extra info, this is used to identify those stimuli that correspond to blank trials (used when constructing GLMdenoise design matrix)",
        "Levels": {
            "n/a": "This was a regular stimulus or in the sixteen seconds at beginning and end of run.",
            "blank trial": "This was a blank stimulus (i.e., just a midgray screen)"
        }
    }
}
